# PARTE 1

## Importacion & almacenaje

In [4]:
import pandas as pd
import numpy as np

In [5]:
# URL del archivo CSV del DataFrame (fork de un Gist original)
url = 'https://gist.githubusercontent.com/dzapatasal/9f521528c196ef6e48732c7cf5a74516/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv'

# Lectura & carga
df = pd.read_csv(url,sep=',')
df

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   NaN      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   NaN      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   NaN      False
10    Danilo    21   NaN      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   NaN      False
15    Milena    29   7.0       True
16     Lucas    33   NaN      False
17     Nadia    34   8.0  Verdadero

In [6]:
# Verificando tipo de datos
type(df)

pandas.core.frame.DataFrame

## Exploracion inicial de los datos

In [7]:
# Visualizacion (7 primeras filas)
df.head(7)

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   NaN    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True
5    Bruna    23   NaN    False
6  Daniela    21   7.0     True

In [8]:
# Visualizacion (5 últimas filas)
df.tail(5)

    Nombre  Edad  Nota   Aprobado
13  Miriam    25   9.0       True
14   Pablo    37   NaN      False
15  Milena    29   7.0       True
16   Lucas    33   NaN      False
17   Nadia    34   8.0  Verdadero

In [9]:
# Verificacion de cantidad de fila
df.shape
# En total 18 filas, 4 columnas

(18, 4)

In [10]:
# Verificación de tipo de dato
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    18 non-null     object
 1   Edad      18 non-null     int64
 2   Nota      12 non-null     float64
 3   Aprobado  18 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 704.0+ bytes

In [11]:
# Verifacion del nombre de las columnas (etiquetas)
df.columns

Index(['Nombre', 'Edad', 'Nota', 'Aprobado'], dtype='object')

# PARTE 2

## NaN values

- Check the total amount of NaN values and replace them with a numeric '0'

In [ ]:
# Visualización de la cantidd de datos nulos.
df.isnull()

    Nombre   Edad   Nota  Aprobado
0    False  False  False     False
1    False  False   True     False
2    False  False  False     False
3    False  False  False     False
4    False  False  False     False
5    False  False   True     False
6    False  False  False     False
7    False  False  False     False
8    False  False  False     False
9    False  False   True     False
10   False  False   True     False
11   False  False  False     False
12   False  False  False     False
13   False  False  False     False
14   False  False   True     False
15   False  False  False     False
16   False  False   True     False
17   False  False  False     False

In [15]:
# Confirmar cantidad de datos nulos
df.isnull().sum()

Nombre      0
Edad        0
Nota        6
Aprobado    0
dtype: int64

In [20]:
# Reemplazamos los NaN por '0' numerico
df.fillna(0)
# Guardamos el nuevo DataFrame sin NaN en una nueva variable.
df_noNaN = df.fillna(0)

In [22]:
# Corroboramos que no haya NaN en el nuevo DataFrame
df_noNaN.isnull().sum()

Nombre      0
Edad        0
Nota        0
Aprobado    0
dtype: int64

## Erase students

- Erase students 'Alicia' and 'Carlos'

In [23]:
df_noNaN

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   0.0      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   0.0      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   0.0      False
10    Danilo    21   0.0      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   0.0      False
15    Milena    29   7.0       True
16     Lucas    33   0.0      False
17     Nadia    34   8.0  Verdadero

In [ ]:
# Filtramos las filas que contienen los nombres 'Alicia' y 'Carlos'
df_noNaN.query('Nombre == "Alicia" or Nombre == "Carlos"')

# Guardamos el DataFrame filtrado en una nueva variable extrayendo el índice de las filas a eliminar
df_filtrado = df_noNaN.query('Nombre == "Alicia" or Nombre == "Carlos"').index

In [39]:
df_filtrado

Index([7, 8], dtype='int64')

In [40]:
# Procedemos a eliminar los alumnos 'Alicia' y 'Carlos' utilizando la variable 'df_filtrado'
df_noNaN.drop(df_filtrado, axis=0)

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   0.0      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   0.0      False
6    Daniela    21   7.0       True
9     Victor    28   0.0      False
10    Danilo    21   0.0      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   0.0      False
15    Milena    29   7.0       True
16     Lucas    33   0.0      False
17     Nadia    34   8.0  Verdadero

In [67]:
# Creamos una nueva variable para almacenar el DataFrame sin los alumnos 'Alicia' y 'Carlos'
df_query_students = df_noNaN.drop(df_filtrado, axis=0)

## Query for approved students

In [68]:
df2 = df_query_students

In [82]:
# Filtramos los estudiantes aprobados
# Colocamos "True" como string para evitar la comparación con el booleano True.
df2.query('Aprobado == "True"')

# Almacenamos el DataFrame filtrado de estudiantes aprobados en una nueva variable
df_aprobados = df2.query('Aprobado == "True"')

## Saving the final DataFrame to a CSV file

In [84]:
# Guardamos el DataFrame de estudiantes aprobados en un archivo CSV en la carpeta 'datasets\processed_dataframes'
path = '../../../datasets/processed_dataframes/alumnos_aprobados.csv'
df_aprobados.to_csv(path, sep=',', index=False)